run/cylinderFlow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 34.723 0 0 );

boundaryField
{
    farfield
    {
        type            inletOutlet;
        inletValue      uniform ( 34.723 0 0 );
        value           uniform ( 34.723 0 0 );
    }
    cylinder
    {
        type            noSlip;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
